#include "guide.h"

void guide()
{
	SetConsoleTitleA((LPCSTR)"Snake");
	CONSOLE_CURSOR_INFO cursor_info = { 20, 0 };
	SetConsoleCursorInfo(GetStdHandle(STD_OUTPUT_HANDLE), &cursor_info);
	int i = 0;

	while (1)
	{
		if (GetAsyncKeyState(27) & 0x8000)
		{
			return;
		}

		if (GetAsyncKeyState(13) & 0x8000)
		{
			break;
		}

		Sleep(0);

		if (i == 1E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 按下W、S、A、D、键以控制蛇头方向，请注意使用英文输入法，不区分大小写                               |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|     按下：W                                                                                        |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                             ><                              |                     |");
			printf("%s\n", "|                |                             []                              |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页1共4");
		}

		if (i == 2E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 按下W、S、A、D、键以控制蛇头方向，请注意使用英文输入法，不区分大小写                               |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|     按下：D                                                                                        |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                             []><                            |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页1共4");
		}

		if (i == 3E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 按下W、S、A、D、键以控制蛇头方向，请注意使用英文输入法，不区分大小写                               |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|     按下：S                                                                                        |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                               []                            |                     |");
			printf("%s\n", "|                |                               ><                            |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页1共4");
		}

		if (i == 4E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 按下W、S、A、D、键以控制蛇头方向，请注意使用英文输入法，不区分大小写                               |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|     按下：A                                                                                        |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                             ><[]                            |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页1共4");
			i = 0;
		}

		++i;
	}

	i = 0;
	Sleep(1000);

	while (1)
	{
		
		if (GetAsyncKeyState(27) & 0x8000)
		{
			return;
		}

		if (GetAsyncKeyState(13) & 0x8000)
		{
			break;
		}

		Sleep(0);

		if (i == 1E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 控制蛇头以吃到食物以得分                                                                           |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                            ~     ><[]                       |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00000                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页2共4");
		}

		if (i == 2E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 控制蛇头以吃到食物以得分                                                                           |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                            ~   ><[]                         |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00000                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页2共4");
		}

		if (i == 3E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 控制蛇头以吃到食物以得分                                                                           |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                            ~ ><[]                           |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00000                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页2共4");
		}

		if (i == 4E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 控制蛇头以吃到食物以得分                                                                           |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                            ><[]                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00001                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页2共4");
		}

		if (i == 5E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 控制蛇头以吃到食物以得分                                                                           |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                          ><[]                               |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00001                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页2共4");
		}

		if (i == 6E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 控制蛇头以吃到食物以得分                                                                           |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                        ><[]                                 |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00001                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页2共4");
			i = 0;
		}

		++i;
	}

	i = 0;
	Sleep(1000);

	while (1)
	{
		if (GetAsyncKeyState(27) & 0x8000)
		{
			return;
		}

		if (GetAsyncKeyState(13) & 0x8000)
		{
			break;
		}

		Sleep(0);

		if (i == 1E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当分数为3的倍数时，蛇身长增加                                                                      |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                            ~   ><[]                         |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00002                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页3共4");
		}

		if (i == 2E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当分数为3的倍数时，蛇身长增加                                                                      |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                            ~ ><[]                           |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00002                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页3共4");
		}

		if (i == 3E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当分数为3的倍数时，蛇身长增加                                                                      |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                          ><[][]                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00003                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页3共4");
		}

		if (i == 4E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当分数为3的倍数时，蛇身长增加                                                                      |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                        ><[][]                               |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                分数：00003                                                                         |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页3共4");
			i = 0;
		}

		++i;
	}

	i = 0;
	Sleep(1000);

	while (1)
	{
		if (GetAsyncKeyState(27) & 0x8000)
		{
			return;
		}

		if (GetAsyncKeyState(13) & 0x8000)
		{
			break;
		}

		Sleep(0);

		if (i == 1E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当蛇头碰到边界或蛇身时，游戏结束                                                                   |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |    ><[][]                                                   |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页4共4");
		}

		if (i == 2E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当蛇头碰到边界或蛇身时，游戏结束                                                                   |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |  ><[][]                                                     |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页4共4");
		}

		if (i == 3E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当蛇头碰到边界或蛇身时，游戏结束                                                                   |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |><[][]                                                       |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页4共4");
		}

		if (i == 4E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当蛇头碰到边界或蛇身时，游戏结束                                                                   |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                          Game Over                          |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页4共4");
			Sleep(100);
		}

		if (i == 5E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当蛇头碰到边界或蛇身时，游戏结束                                                                   |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                      [][][][][]                             |                     |");
			printf("%s\n", "|                |                      []    ><[]                             |                     |");
			printf("%s\n", "|                |                      []                                     |                     |");
			printf("%s\n", "|                |                      []                                     |                     |");
			printf("%s\n", "|                |                      []                                     |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页4共4");
		}

		if (i == 6E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当蛇头碰到边界或蛇身时，游戏结束                                                                   |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                      [][][][][]                             |                     |");
			printf("%s\n", "|                |                      []  ><[][]                             |                     |");
			printf("%s\n", "|                |                      []                                     |                     |");
			printf("%s\n", "|                |                      []                                     |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页4共4");
		}

		if (i == 7E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当蛇头碰到边界或蛇身时，游戏结束                                                                   |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                      [][][][][]                             |                     |");
			printf("%s\n", "|                |                      []><[][][]                             |                     |");
			printf("%s\n", "|                |                      []                                     |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页4共4");
		}

		if (i == 8E6)
		{
			system("cls");
			printf("%s\n", "教程");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "| 当蛇头碰到边界或蛇身时，游戏结束                                                                   |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                          Game Over                          |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                |                                                             |                     |");
			printf("%s\n", "|                ---------------------------------------------------------------                     |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "|                                                                                                    |");
			printf("%s\n", "------------------------------------------------------------------------------------------------------");
			printf("%s\n", "按下Enter键以进入下一页，Esc键以退出                                                            页4共4");
			Sleep(100);
			i = 0;
		}

		++i;
	}

	system("cls");
	printf("%s\n", "教程");
	printf("%s\n", "------------------------------------------------------------------------------------------------------");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                        现在，尽情享受Snake吧！                                                     |");
	printf("%s\n", "|                                        ——本程序作者：韩健桐                                        |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "|                                                                                                    |");
	printf("%s\n", "------------------------------------------------------------------------------------------------------");
	system("pause");
	return;
}